{
  "sections": {
    "overview": {
      "title": "Overview",
      "content": "`grove-core` is a Go library that provides shared packages and utilities for tools in the Grove ecosystem.",
      "subsections": [
        {
          "title": "Role in the Ecosystem",
          "content": "All executable tools in the Grove ecosystem import `grove-core` as a Go module. This provides a consistent implementation for command-line interaction, configuration file loading, logging, and error handling, which reduces duplicated code."
        },
        {
          "title": "How It Works",
          "content": "A Grove tool uses the `cli` package to create a `cobra` command with standard flags (`--config`, `--json`, `--verbose`). The `config` package then loads and merges `grove.yml` files from a series of locations: a global directory, an optional parent ecosystem directory, the current project directory, and local override files. The `logging` package uses this configuration to set up a logger. Functions like `logging.NewLogger(\"component\")` create log entries tagged with a component name, which are then written to standard output, standard error, or a file as configured."
        },
        {
          "title": "Packages",
          "content": "### cli\nProvides functions for building command-line interfaces with `cobra`.\n*   `NewStandardCommand` creates a command with a standard set of persistent flags (`--verbose`, `--json`, `--config`).\n*   `GetLogger` and `GetOptions` initialize a logger and retrieve common options from command-line flags.\n*   An error handler presents messages for predefined error types.\n*   `NewVersionCommand` creates a command that displays build information.\n\n### command\nExecutes external commands with validation.\n*   A `SafeBuilder` creates `exec.Cmd` instances and can validate arguments against predefined patterns for filenames or Git references.\n*   Integrates with Go's `context` package for command timeouts and cancellation.\n\n### config\nManages `grove.yml` configuration files.\n*   Loads and merges configuration from multiple sources in order: global, ecosystem, project, and override files.\n*   Captures non-standard top-level keys in an `Extensions` map for use by other tools.\n*   Replaces `${VAR}` or `${VAR:-default}` syntax with environment variable values.\n*   Validates `grove.yml` against an embedded JSON schema.\n\n### conventional\nParses Conventional Commit messages.\n*   Parses commit messages into a structured format.\n*   Generates changelogs from a list of commits.\n\n### errors\nDefines a structured error type for the ecosystem.\n*   `GroveError` contains a machine-readable `ErrorCode` (e.g., `CONFIG_NOT_FOUND`), a message, and a map of contextual details.\n*   Provides constructor functions for common error conditions such as `ServiceNotFound` or `ConfigInvalid`.\n\n### fs\nProvides filesystem utilities.\n*   Contains functions to copy single files and recursively copy directories.\n\n### git\nInteracts with Git repositories by executing `git` commands.\n*   Functions to get repository information such as current branch, repository root, remote URL, and status.\n*   A `WorktreeManager` to create, list, and remove Git worktrees.\n*   An interface for installing and uninstalling Git hooks.\n\n### logging\nProvides a centralized logging system built on Logrus.\n*   `NewLogger(\"component-name\")` creates a logger that tags messages with a component name.\n*   Log level, format (text or JSON), and file output are configured in `grove.yml`.\n*   The `UnifiedLogger` writes a log event to both a structured format for machine processing and a styled format for terminal output.\n*   Provides functions to show or hide log output from specific components based on configuration rules.\n\n### pkg/alias\nResolves workspace aliases to absolute file paths.\n*   Translates project aliases like `\"ecosystem:repo:worktree\"` into an absolute path.\n*   Translates notebook resource aliases that are prefixed with `nb:`.\n\n### pkg/models\nContains shared data structures for Grove services.\n*   Includes types for sessions, events, tool executions, transcripts, and notifications.\n\n### pkg/process\nProvides process utilities.\n*   Includes a function `IsProcessAlive` to check if a process with a given PID is running.\n\n### pkg/profiling\nProvides performance profiling utilities for command-line applications.\n*   Integrates with Cobra commands to add flags for enabling CPU and memory profiling.\n*   Includes a hierarchical timer for measuring the duration of nested function calls.\n\n### pkg/repo\nManages local clones of remote git repositories.\n*   Clones repositories as bare repos and checks out specific versions into worktrees.\n*   Maintains a manifest of managed repositories and their worktrees.\n\n### pkg/sessions\nManages metadata for live, stateful sessions.\n*   A filesystem-based registry tracks running processes and their associated session metadata.\n\n### pkg/tmux\nA Go client for managing tmux sessions, windows, and panes.\n*   Functions to create, check for existence, kill, and list tmux sessions.\n*   Functions to create windows, split panes, send keys, and capture pane content.\n*   A function to block execution until a specified tmux session closes.\n\n### pkg/workspace\nDiscovers and classifies Grove workspaces on the filesystem.\n*   `DiscoveryService` scans configured directories to find ecosystems, projects, and worktrees.\n*   Classifies entities based on `grove.yml` content and filesystem markers, assigning a `WorkspaceKind`.\n*   `GetProjectByPath` finds the containing workspace for a given directory path without performing a full scan.\n*   The `Provider` holds a snapshot of discovered workspaces for in-memory lookups.\n\n### schema\nManages JSON schema for `grove.yml` configuration files.\n*   Contains an embedded base schema for core `grove.yml` properties.\n*   Provides a validator to check configuration data against the schema.\n*   Includes a manifest of extension schemas used for composing a unified schema.\n\n### starship\nProvides commands for integration with the Starship shell prompt.\n*   An `install` command modifies `starship.toml` to add a custom module.\n*   A `status` command, used by the prompt, queries registered providers for status strings to display.\n\n### state\nManages local workspace state.\n*   Loads from and saves key-value data to a `.grove/state.yml` file in the current workspace.\n\n### tui\nProvides reusable components for building terminal user interfaces with Bubble Tea.\n*   `navigator`: A component for browsing projects and files.\n*   `logviewer`: A component for tailing and viewing log files.\n*   `jsontree`: A component for interactively exploring JSON data.\n*   `help`: A component for displaying keybindings.\n*   `theme`: A theming system with color palettes and icons.\n*   `keymap`: A standardized set of keybindings.\n\n### util/pathutil\nProvides path expansion and normalization utilities.\n*   Expands home directory (`~`), environment variables, and git variables in path strings.\n*   Normalizes paths for case-insensitive filesystem comparisons by resolving symlinks and converting to lowercase on macOS and Windows.\n\n### util/sanitize\nSanitizes strings for various technical contexts.\n*   Functions to format strings for use as Docker labels, domain names, filenames, and environment variables.\n\n### version\nEmbeds build information into binaries.\n*   Contains variables that are populated by Go linker flags for version, commit, branch, and build date.\n\n### Installation\n\nGrove-core is a Go library. Add it to your project:\n\nImport in your Go code:\n\nSee the [Grove Development Guide](https://github.com/mattsolo1/grove-meta/blob/main/docs/02-installation.md#building-from-source) for development setup.",
          "code_blocks": [
            "go get github.com/mattsolo1/grove-core",
            "import \"github.com/mattsolo1/grove-core/cli\""
          ]
        }
      ]
    }
  }
}